{
  "gpt-4.1": "Extremely reliable and consistent. Handles complex code and reasoning tasks with ease, albeit with the unique quirk of being a bit too hesitant to make bold decisions. It oftentimes seems to get stuck on asking for clarification, and not actually getting things done. Despite that, it's still my go-to for most serious work.",
  "o4-mini-medium": "O4-Mini (Medium) is quite possibly the best value model in the entirety of Windsurf. It's cheap, decent with toolcalling, highly intelligent, and is a good balance between speed, response delay, output intelligence, and price. Would highly recommend for medium difficulty problems. I wouldn't put it over GPT-4.1 though, because GPT-4.1 has no response delay (no thinking time), is better with instruction following, and has a much larger context window. Still decent, but not as good as GPT-4.1 for most tasks.",
  "o4-mini-high": "O4-Mini (High) is a step above O4-Mini (Medium) in intelligence, but I'd honestly say it's not a worthy upgrade. The output delay is even longer, it's more expensive, and I've seen no meaningful performance improvement. If you need that little extra boost, it's for you. But for me... yeah, no. I'd just stick with O4-Mini (Medium).",
  "3.7-sonnet": "The creme de la creme of agentic based coding models, 3.7 Sonnet is in a world of it's own. It was my go-to model for AGES, only recently being upstaged by GPT-4.1. It's an ambitious model with lots to love, and brilliant tool calling performance. If you're willing to work with it's high price tag and ambitiousness, it's quite decent.",
  "3.7-sonnet-thinking": "This is a thinking model variant of 3.7 Sonnet, and is a step above 3.7 Sonnet in intelligence. There's not much more to be said, it's a better version of 3.7 Sonnet that's more expensive, if you're needing that little kick.",
  "gemini-2.5-pro": "Gemini 2.5 Pro is the best model in Windsurf. It's got everything to love from GPT-4.1, with the reasoning capabilities of OpenAI's other thinking models, all while being lightning fast and super intelligent. I'd recommend this model as the go-to model for everybody, if you're willing to handle its price.",
  "o3-medium-reasoning": "O3 (Medium Reasoning) is the medium tier of O3 provied with the O3 line of reasoning models provided by OpenAI in Windsurf. It's extremely intelligent but it suffers due to an obscenely high price point. I'd generally stay away.",
  "o3-high-reasoning": "O3 (High Reasoning) is the high tier of O3 provied with the O3 line of reasoning models provided by OpenAI in Windsurf. It's extremely intelligent but it suffers due to an obscenely high price point. I'd generally stay away.",
  "3.5-sonnet": "3.5 Sonnet used to be the KING of agentic coding models, but now that 3.7 Sonnet is out, there's really no reason to use 3.5 Sonnet anymore. It's still a solid model, but it's not as good as 3.7 Sonnet.",
  "gpt-4o": "Shockingly poor in Windsurf. Despite being a solid model according to the benchmarks, it appears that 4o is just not as capable in the agentic framework as it should reasonably be. Recent updates have improved it, but I still wouldn't recommend it considering that Claude 3.7/3.5 are far better options for the same price.",
  "deepseek-v3": "DeepSeek V3 (0324) is a decent model, and performs slightly better than Cascade Base. However, due to the recent change by Windsurf to make DeepSeek R1 free, this model has been overshadowed. If you prefer faster responses and a model that's more stable, use Deepseek V3. If you prefer a smarter model, use Deepseek R1.",
  "deepseek-r1": "Deepseek R1 is the best free model in Windsurf. It's a thinking model that may have the occasional tweakout, but considering that it's entirely free and is capable of thinking before it responds, it's clear that this is the best free model in Windsurf.",
  "grok-3": "Grok 3 is a pretty dang decent model, all things considered. It has a million token context window, solid speed, and decent performance. However, I still find no real reason to use this model because GPT-4.1 does everything it can do, but better.",
  "grok-3-mini-thinking": "Now the thinking variant of Grok 3? That's interesting. It's 1/8th of a token, and with that, you get the same fast speed and million token context window, but with the benefit of thinking model intelligence and a cheap price. An honestly highly underrated model that I urge everyone to check out.",
  "o3-mini-medium-reasoning": "There's no need to use this model anymore, the O4 Mini series is better in every way. Surprised this isn't a deprecated model, personally.",
  "gemini-2.5-flash": "A unique model, in that it's currently only available to users on Windsurf Next. It's a variation of the Gemini 2.5 lineup that punches far above its weight. It's a lightning fast, cheap model with a million token context window, and solid performance. This is the model that your girl says not to worry about :P",
  "gemini-2.0-flash": "Enjoy Gemini 2.0 Flash while it lasts, because it's going to be deprecated for 2.5 Flash. It's a bit odd how it hasn't already been deprecated, but I'm sure the Windsurf developers will get around to doing that sometime soon.",
  "swe-1": "A new, frontier model created by the Windsurf team. It's been specifically designed to be a \"software engineering\" model, with a focus on Cascade's flow system. It is quoted to be slightly better than Claude 3.5 Sonnet, while being vastly cheaper.",
  "swe-1-lite": "A new, smaller frontier model created by the Windsurf team. It's been specifically designed to be a \"software engineering\" model, with a focus on Cascade's flow system. It will be free for all users and is a cheaper, faster, and lighter version of SWE-1. It was previously the obsfuscated \"Vista\" model, but has been rebranded to \"SWE-1 Lite\". It will replace the old Cascade Base model."
}
