{
  "swe-1.5": "The latest and greatest from the Windsurf team! SWE-1.5 achieves near-Claude 4.5 level performance at 13x the speed. It's built specifically for software engineering and agentic workflows. At just 1 credit, it's an incredible value proposition that punches way above its weight class. This is Windsurf's flagship model and it shows.",
  "claude-sonnet-4.5": "The new king of Claude models. Sonnet 4.5 represents a massive leap forward in intelligence and capability. It's expensive at 2 credits, but the performance is undeniable. This model excels at complex reasoning, long-context tasks, and multi-step workflows. If you need the absolute best and cost isn't a concern, this is your model.",
  "claude-sonnet-4.5-thinking": "The thinking variant of Sonnet 4.5 adds extended reasoning capabilities. At 3 credits it's even pricier, but for tasks that require deep analysis and careful consideration, the extra thinking time pays dividends. Use this when you need the model to really ponder before responding.",
  "claude-haiku-4.5": "A surprisingly capable lightweight option from Anthropic. At just 1 credit, Haiku 4.5 offers solid performance with blazing fast speed. It's not as capable as the Sonnet variants, but for quick iterations and simpler tasks, it's a great choice that won't break the credit bank.",
  "claude-opus-4.1": "The absolute heavyweight champion. At 20 credits per prompt, Opus 4.1 is designed for the most demanding tasks imaginable. Unless you're working on something that requires maximum intelligence and have credits to spare, this is likely overkill for most use cases. But when you need the best of the best, nothing else compares.",
  "claude-opus-4.1-thinking": "Opus 4.1 with extended thinking. Also 20 credits. This is for when you need the pinnacle of AI capability with deep reasoning. Honestly, at this price point, you're better off using multiple cheaper models unless the task genuinely demands this level of capability.",
  "gpt-5-low": "The entry point into the GPT-5 lineup. At 0.5 credits, it offers decent performance with low reasoning overhead. It's fast and efficient, great for straightforward coding tasks that don't require deep analysis. A solid daily driver for basic work.",
  "gpt-5-medium": "The sweet spot of the GPT-5 family. 1 credit gets you enhanced reasoning without breaking the bank. This is probably where most users will land for general purpose coding work. Good balance of speed, intelligence, and cost.",
  "gpt-5-high": "When you need GPT-5 to really think things through. At 2 credits, it offers maximum reasoning capability in the GPT-5 line. The extra thinking time can be noticeable, but for complex problems it's worth the wait and cost.",
  "gpt-5-codex": "The free GPT-5 variant! Optimized specifically for code. It's completely free which makes it an incredible value. Performance is solid for coding tasks, though it won't match the reasoning capabilities of the paid variants. Great for quick code generation and basic refactoring.",
  "gpt-4.1": "Extremely reliable and consistent. Handles complex code and reasoning tasks with ease, albeit with the unique quirk of being a bit too hesitant to make bold decisions. It oftentimes seems to get stuck on asking for clarification, and not actually getting things done. Despite that, it's still a solid choice for serious work at 1 credit.",
  "3.7-sonnet": "Still a capable model, though now overshadowed by the 4.5 series. At 2 credits it's the same price as Sonnet 4.5, so there's really no reason to use this anymore unless you specifically need its behavior. It had a good run being the king of agentic coding, but time moves fast in AI.",
  "3.7-sonnet-thinking": "The thinking variant of 3.7 Sonnet at 3 credits. With Sonnet 4.5 and 4.5 Thinking available at similar prices, this model has been completely superseded. Only use if you have a specific reason to prefer 3.7's behavior.",
  "gemini-2.5-pro": "Gemini 2.5 Pro remains an excellent choice. At 1 credit with a massive million token context window and great speed, it's a powerhouse. Strong performance across the board makes this a reliable workhorse model that delivers consistent results.",
  "o3": "The new O3 at just 1 credit is a solid option. Decent reasoning capabilities at an affordable price point. It's not going to blow you away, but it gets the job done reliably for most tasks.",
  "o3-high-reasoning": "O3 with enhanced reasoning, still at 1 credit. The extra reasoning capability is nice, though honestly at this price point there are other models that might serve you better. Worth trying if O3's reasoning style clicks with your workflow.",
  "gpt-oss-120b": "An interesting open-source based model at 0.25 credits. Very cheap and surprisingly capable for the price. Good for experimentation and tasks where you need to conserve credits. Don't expect miracles, but it's solid for basic work.",
  "3.5-sonnet": "The original king, now thoroughly dethroned. At 2 credits with 3.7 and 4.5 Sonnet available at the same price, there's really no reason to use 3.5 anymore. It's still competent, but you're better off with newer options.",
  "gpt-4o": "Still underwhelming in Windsurf's agentic framework. At 1 credit there are simply better options available. Recent updates have improved it somewhat, but I'd still reach for other models first.",
  "deepseek-v3": "A free model that offers decent performance. It's stable and reliable, though not as capable as DeepSeek-R1. If you want speed and stability over raw intelligence, V3 is your pick. But honestly, R1 is the better choice most of the time.",
  "deepseek-r1": "At 0.5 credits, this is an absolute steal. A thinking model that occasionally has quirks, but the value proposition is unbeatable. For half a credit you get genuine reasoning capabilities. This should be in everyone's rotation for cost-effective work.",
  "grok-code-fast": "A free model from xAI with a million token context window. It's fast and capable, making it great for quick iterations. Being free makes it perfect for experimentation and tasks where you're burning through lots of prompts.",
  "swe-1": "The original Windsurf flagship model. Free and still quite capable, though now overshadowed by SWE-1.5. It's optimized for software engineering workflows and being free makes it great for experimentation. Definitely worth keeping in your toolkit.",
  "qwen3-coder": "A solid coding model from Alibaba at 0.5 credits. With a large 262k context window, it's good for working with larger codebases. Performance is decent, though you might want to try other options first before settling on this one.",
  "qwen3-coder-fast": "The fast variant at 2 credits with blazing 1747 tokens/second speed. The speed is impressive, but at 2 credits it's pricey. Only worth it if you genuinely need that extreme speed for your workflow.",
  "kimi-k2": "Moonshot AI's entry at 0.5 credits. Decent performance with a 130k context window. It's fine for general work, though there are usually better options at similar price points. Worth trying if other models aren't clicking for you.",
  "claude-sonnet-4": "An earlier variant that's been superseded by Sonnet 4.5. At 2 credits, you should just use 4.5 instead. Only here for compatibility with existing workflows.",
  "claude-sonnet-4-thinking": "The thinking variant of Sonnet 4 at 3 credits. Like its non-thinking counterpart, it's been superseded by the 4.5 series. Use 4.5 Thinking instead for better performance at the same price."
}
